engemil/attentiolight-1-wireless-module-firmware/fw_al1_wmod/sdkconfig.defaults
# AttentioLight-1 Wireless Module Firmware — default sdkconfig values.
# Anything not overridden here uses the ESP-IDF defaults for the target.
# `idf.py set-target esp32c3` (or `idf.py build` after set-target) merges these.

# ----- Target -----
CONFIG_IDF_TARGET="esp32c3"

# ----- BLE stack (NimBLE — smaller footprint than Bluedroid for C3) -----
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# LE Secure Connections (mandatory for Just-Works on modern BLE)
CONFIG_BT_NIMBLE_SM_LEGACY=n
CONFIG_BT_NIMBLE_SM_SC=y
# Persist bonds across reboots
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# ----- WiFi (stack compiled in, radio OFF at runtime) -----
# Decision: keep the WiFi stack ENABLED in the build (CONFIG_ESP_WIFI_ENABLED=y,
# the IDF default) so enabling WiFi later needs no sdkconfig change. The radio
# does NOT auto-start — ESP32 WiFi only powers on when the app calls
# esp_wifi_init() + esp_wifi_start(). This firmware never calls those, so WiFi
# stays off at runtime: the intended "off from the application side" posture.
# (Image budget is fine: hello-world is ~17% of the app partition.)

# ----- Console / log -----
# The console must NOT use UART0: its default pins (GPIO21=U0TXD, GPIO20=U0RXD)
# are the STM32<->ESP32 link pins (al1_link). Route the console to the built-in
# USB-Serial-JTAG instead so UART0's pads are free for the link at 921600.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# ----- Partition table (custom; defined in partitions.csv) -----
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ----- Compiler -----
# -Og is more debug-friendly; we'll switch to -Os/release later for size.
CONFIG_COMPILER_OPTIMIZATION_DEBUG=y
